xfire-aegis/src/test/org/codehaus/xfire/aegis/type/collection/ReceiveTooManyStrings.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <receiveStrings xmlns="urn:min-max-test">
    <strings xmlns:s="http://collection.type.aegis.xfire.codehaus.org">
      <s:string>1.0</s:string>
      <s:string>1.0</s:string>
      <s:string>1.0</s:string>
      <s:string>1.0</s:string>
      <s:string>1.0</s:string>
    </strings>
  </receiveStrings>
 </env:Body>
</env:Envelope>